[{"subject":"SOC","number":"1010","title":"Intro to Sociology","description":"Fundamental concepts and basic principles underlying human social relations. ","prerequisites":["ENGL 1010    ","   DSPR 0800    ","  DSPR 4   ","  A03 19 to 36   ","  S03 710 to 800"],"credits":3},{"subject":"SOC","number":"1020","title":"First Year Connections","description":"A course required for all sociology majors, designed to assist the student in acquiring basic knowledge and skills necessary to be a successful sociology major. Additional focus upon personal and academic adjustments to college in general. May be taken at the same time as SOC 1010. Must be taken at first opportunity after declaration of sociology as a major. ","credits":1},{"subject":"SOC","number":"1650","title":"Social Problems","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Contemporary social problems. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"2100","title":"Cultural Ecology","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Interaction between human cultural systems and the physical environment in prehistoric through modern times. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"2110","title":"Soc Class/Inequality in Am","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Current and comprehensive description of the social class structure, socioeconomic inequality, and related politics of American society. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"2630","title":"Marriage \u0026 Family Relations","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. A sociological approach to marriage and family living, dating, male-female roles, mate selection, martial adjustment, parenthood, widowhood, divorce, and remarriage. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"2660","title":"Criminology","description":"Prerequisite: Sophomore standing. Crime, the criminal, and society\u0027s responses to the behavior. ","credits":3},{"subject":"SOC","number":"2840","title":"The Aged in Amer Society","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Analysis of social, psychological, and economic problems in aging. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"2900","title":"Intro-Sociological Research","description":"","credits":3},{"subject":"SOC","number":"3100","title":"Sociological Theory","description":"Prerequisite: SOC 1010. Survey of the development of major schools of thought in modern sociology with instruction and evaluation in oral presentations. ","prerequisites":["SOC 1010"],"credits":3},{"subject":"SOC","number":"3150","title":"Social Psychology","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. This course will examine how individuals shape and are shaped by their social situations. There will be a particular emphasis on the symbolic interaction perspective with the goal of helping students better understand their identities and social interactions. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"3200","title":"Sociology of Sex \u0026 Gender","description":"","prerequisites":["SOC 1010    ","   SOC 1000"],"credits":3},{"subject":"SOC","number":"3300","title":"Occupational Sociology","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. The social dimensions of occupations (both legitimate and deviant) with an emphasis on the troubles and tensions workers encounter. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"3500","title":"Sociological Theory","description":"","credits":3},{"subject":"SOC","number":"3550","title":"Applied Sociology","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Applications of sociological knowledge and its relation to the context of interaction between sociologists and policy-makers. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"3600","title":"Environmental Sociology","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Explores the relationship between society and the physical environment with emphasis on environmental usage patterns, environmental justice issues, and the causes and consequences of environmental pollution and over-population problems, with an orientation toward possible solutions of these problems. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"3610","title":"Juvenile Delinquency","description":"","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"3620","title":"Victimology","description":"Prerequisite: SOC 1010 or CJ 2660. Students must be majoring in SOC, SOC/CJ or SOC/SW. Non-majors may be admitted by consent of instructor. This course provides an in-depth analysis of the victims of criminal activity including: the various challenges victims face as they seek justice through the criminal justice system; the risk factors and probability of experiencing crime; and, specific theoretical perspectives that center on the victims of crime. Topics such as restorative justice and victim blaming are also explored. ","prerequisites":["SOC 1010    ","   CJ 2660"],"credits":3},{"subject":"SOC","number":"3640","title":"Cybercrime","description":"Prerequisite: SOC 1010 or CJ 2660 or consent of the instructor. This course provides a broad introduction into the world of cybercrime. Cybercrime includes various forms of criminal activity and is broadly defined as the destruction, theft or unauthorized or illegal use, modification or copying of information, programs, services, equipment, or communication networks. ","prerequisites":["SOC 1010    ","   CJ 2660"],"credits":3},{"subject":"SOC","number":"3650","title":"Youth and Society","description":"Prerequisite: Sophomore standing and SOC 1010. The study of the causes of juvenile misconduct, possible responses to the problem, and the system of juvenile justice. ","prerequisites":["SOC 1010"],"credits":3},{"subject":"SOC","number":"3700","title":"Sociology of Childhood","description":"","credits":3},{"subject":"SOC","number":"3710","title":"Urban Sociology","description":"Prerequisite: SOC 1010 or consent of instructor. History of urbanization. Analysis of contemporary urban society and its social problems. ","prerequisites":["SOC 1010"],"credits":3},{"subject":"SOC","number":"3720","title":"Rural Sociology","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Development of rural society, its relationship to urban society, and contemporary rural social problems. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"3730","title":"Technology and Society","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Relationships of different types of technologies to different types of social and cultural systems. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"3900","title":"Intro-Sociological Research","description":"Prerequisite: SOC 1010 and three hours of sociology or consent of instructor. Methods of sociological research including considerations of research design, strategies, techniques, and procedures. ","prerequisites":["SOC 1010   ","  SOC 1100 to 4999    ","   SOC ELEC"],"credits":3},{"subject":"SOC","number":"3910","title":"Soc Science Stat Analysis","description":"Prerequisite: SOC 1010 or CJ 2660 or SW 1800. Introduction to basic statistics and their uses in the social sciences. ","prerequisites":["CJ 2660    ","   SOC 1010    ","   SW 1800"],"credits":3},{"subject":"SOC","number":"3911","title":"Introduction to Crime Analysis","description":"Prerequisite: SOC 1010 or CJ 2660. Sociology majors only. Non majors may be admitted by consent of instructor. This course provides students with a broad understanding of Microsoft Excel with application to crime analysis in order to prepare them for conducting advanced spatial analysis in CJ/SOC 4911. ","prerequisites":["SOC 1010    ","   CJ 2660"],"credits":3},{"subject":"SOC","number":"3920","title":"Soc Applications Using SSPS","description":"Prerequisite: SOC 3910. This course deals with applications of the Statistical Package for the Social Sciences (SPS) including: direct data input, data importation from other sources (i.e. national data base and Excel spreadsheets), and using SPSS to perform and interpret a wide variety of commonly used statistical applications in sociology ranging from descriptive statistics to multivariate analysis. ","prerequisites":["SOC 3910"],"credits":3},{"subject":"SOC","number":"4010","title":"Organized Crime","description":"Prerequisite: Sophomore standing and SOC 1010 or CJ (SOC) 2660. Organized crime in America as a product of legal, historical, cultural, and economic forces. ","prerequisites":["SOC 1010    ","   CJ 2660    ","   SOC 2660"],"credits":3},{"subject":"SOC","number":"4040","title":"Law \u0026 Culture","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. A comparative cross-cultural analysis of primitive, traditional, and modern attitudes toward law, social control, punishment, and individual responsibility. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4050","title":"Crime and Media","description":"Prerequisite SOC 1010 or SOC/CJ 2660 or consent of the instructor. An analysis of crimes, criminals, and punishment as they appear in American popular culture and various media. ","prerequisites":["SOC 1010    ","   SOC 2660    ","   CJ 2660"],"credits":3},{"subject":"SOC","number":"4080","title":"Sociology of Appalachia","description":"Prerequisite: SOC 1010 or 1100 or consent of the instructor. An exploration of the people, culture, and political economy of Appalachia. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4090","title":"Cross Cult Comm/Cult Diversity","description":"An examination of the socio-cultural context of communication with emphasis upon enhancing communication skills across cultures. ","credits":3},{"subject":"SOC","number":"4120","title":"Death and Dying","description":"Prerequisites: SOC 1010 or 1100 or consent of instructor. The social and cultural dimensions of death and dying in American society with emphasis on the meaning of death, the death industry, the social context of death and dying, and bereavement. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4210","title":"Race/Ethnicity/Multicultural","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Ethnic and cultural variations in the U.S. and similar mass societies. Emphasis on economic, political, and social relationships between ethnic groups. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4220","title":"Sociology of Mass Comm","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Historical and organizational analysis of various mass media and their content. Social issues and the mass media. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4320","title":"Sociology of Religion","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Cross-cultural analysis of religion as a social factor at the societal, organizational, and personality systems levels. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4330","title":"Population \u0026 Social Process","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Sociological analysis of the interrelationship between particular population characteristics and patterns of social organization. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4350","title":"White Collar Crime","description":"Prerequisite: SOC 1010, or SOC 2660, or consent of the instructor. Criminological and sociological examination of offenders and victims of crimes in the world of business and government committed in the course of legitimate occupations. ","prerequisites":["SOC 1010    ","   SOC 2660"],"credits":3},{"subject":"SOC","number":"4430","title":"People in Organizations","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Analysis of the structures and processes of large bureaucratic organizations with emphasis on individuals\u0027 relationships to them. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4500","title":"Soc-Alcohol Abuse/Alcoholism","description":"Prerequisites: SOC 1010 or 1100 or consent of instructor. Sociological analysis of alcohol abuse and alcoholism, issues in prevention and rehabilitation, and implications for education. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"451","title":"Intro Social Research","description":"","credits":3},{"subject":"SOC","number":"4510","title":"Social Deviance","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Examination of various groups who are identified as deviant due to their unacceptable behavior and relative powerlessness. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4515","title":"Sexual Offenses and Offenders","description":"Prerequisite: SOC 1010 Introduction to Sociology. This course provides a broad introduction in to the world of sexual offenses. Accordingly, this course will provide information on survivors of these crimes, perpetrators, as well as relevant sociological factors. An emphasis will be placed on understanding the perpetrator specifically. ","prerequisites":["SOC 1010"],"credits":3},{"subject":"SOC","number":"4520","title":"Patterns of Domestic Violence","description":"Prerequisite: SOC 1010 or CJ 2660 or consent of instructor. This course investigates all forms of domestic violence from a sociological perspective including theoretical explanations, prevalence, risk factors, dynamics of prevention, and intervention. ","prerequisites":["SOC 1010    ","   CJ 2660"],"credits":3},{"subject":"SOC","number":"4530","title":"Sociology of Murder","description":"Prerequisite: SOC 1010 or CJ 2660 or consent of the instructor. This course provides an analytical study of murder and violence in the United States. As such, course topics include: different types of homicide, offender characteristics, victim characteristics, etiological considerations of becoming an offender or victim, the role of social profiling in the investigation of various types of murder, theoretical approaches to the study of murder, and patterns and sources of violence. Taking into account the grisly topic, students who are disturbed by particularly heinous crimes should avoid enrolling in this course. ","prerequisites":["SOC 1010    ","   CJ 2660"],"credits":3},{"subject":"SOC","number":"4540","title":"Women and Crime","description":"Must be a major in: SOC; SOC/CJ or SOC/SW. Non-majors by permission from instructor. This course provides an in-depth analysis on women\u0027s involvement in both crime enforcement, and crime perpetration. The course examines how societal gender norms and concepts such as \"femininity\" impact women as law enforcers, perpetrators, and victims of crime. ","prerequisites":["SOC 1010    ","   CJ 2660"],"credits":3},{"subject":"SOC","number":"4610","title":"Contemporary Amer Family","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Models of family organization, variations in the institutional pattern, kinship, and basic social trends affecting the family. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4660","title":"Corrections","description":"Prerequisite: Sophomore standing and SOC 1010 or CJ (SOC) 2660 or SW 1800. Correctional services, practices, and issues with particular attention to the maximum security adult institution. ","prerequisites":["SOC 1010    ","   SOC 2660    ","   CJ 2660    ","   SW 1800"],"credits":3},{"subject":"SOC","number":"4720","title":"Sociological Theories","description":"","credits":3},{"subject":"SOC","number":"4810","title":"Concepts of Gerontology","description":"Prerequisites: PSY 3200 or 3300 or SOC 1010. Physical and psychosocial aging processes. Issues in the care of the senior adult. ","prerequisites":["SOC 1010    ","   PSY 3200    ","   PSY 3300"],"credits":3},{"subject":"SOC","number":"4830","title":"Medical Sociology","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Examination of the significance of the complex relationship between attitudes, beliefs relating to the underlying causes of disease, the level of health characteristics, appropriate treatment practices, and the role of the healer in various groups and societies. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4860","title":"Social Movements \u0026 Change","description":"Prerequisite: SOC 1010 or 1100 or consent of instructor. Analysis of social movements and other kinds of planned and unplanned change in society. ","prerequisites":["SOC 1010    ","   SOC 1100"],"credits":3},{"subject":"SOC","number":"4900","title":"Internship","description":"Prerequisite: Nine hours of sociology. See instructor prior to enrolling. Students are placed with and work in a public or private agency which is compatible with their interests. (Students may take a maximum of two internships for up to a total of 6 hours of Internship. Up to 6 hours may be taken for upper division credit to fulfill major or minor requirements with any additional hours counting as upper division general elective hours). ","credits":3},{"subject":"SOC","number":"4901","title":"Internship","description":"Prerequisite: Nine hours of sociology. See instructor prior to enrolling. Students are placed with and work in a public or private agency which is compatible with their interests. (Students may take a maximum of two internships for up to a total of 6 hours of Internship. Up to 6 hours may be taken for upper division credit to fulfill major or minor requirements with any additional hours counting as upper division general elective hours). ","credits":3},{"subject":"SOC","number":"4911","title":"GIS Mapping for the Soc Sci","description":"Prerequisites SOC 1010 Introduction to Sociology. This course provides a broad introduction into the world of geographic information systems (GIS) and their applicability to the social sciences - particularly criminal justice. Students are required to complete a major research project using GIS applications and to present the results. ","prerequisites":["SOC 1010"],"credits":3},{"subject":"SOC","number":"4915","title":"Internship","description":"Prerequisite: Nine hours of sociology. Six hour internships are only available for internships that offer special opportunities that are not available in a 3 hour internship. See instructor prior to enrolling to determine if an available internship opportunity qualifies for 6 hours of credit. ","credits":6},{"subject":"SOC","number":"4920","title":"Data Analysis \u0026 Mgmt","description":"Prerequisite: SOC 3900 and SOC 3910 The techniques of management and analysis of quantitative social science data from primary and secondary sources. ","prerequisites":["SOC 3900   ","  SOC 3910"],"credits":3},{"subject":"SOC","number":"4925","title":"Internship","description":"Prerequisite: Nine hours of sociology. Nine hour internships are only available for internships that offer special opportunities that are not available in a 3 or 6 hour internship. The great majority of these will be summer internships that require the intern to work a 40 hour week. See instructor prior to enrolling to determine if an available internship opportunity qualifies for 9 hours of credit. ","credits":9},{"subject":"SOC","number":"4930","title":"Field Research Methods","description":"Prerequisite: SOC 3900 or consent of instructor. An in-depth examination and direct involvement with various qualitative research tools and techniques used by sociologists. ","prerequisites":["SOC 3900"],"credits":3},{"subject":"SOC","number":"4940","title":"Independent Study","description":"Prerequisite: Consent of instructor. Allows the student to undertake study in an area of sociology where there is no appropriate course. Students may take a total of up to 6 hours of Independent Study hours with no more than 3 hours on a single topic. Up to 6 hours may be taken for upper division credit to fulfill major or minor requirements. ","credits":1},{"subject":"SOC","number":"4941","title":"Independent Study","description":"Prerequisite: Consent of instructor. Allows the student to undertake study in an area of sociology where there is no appropriate course. Students may take a total of up to 6 hours of Independent Study hours with no more than 3 hours on a single topic. Up to 6 hours may be taken for upper division credit to fulfill major or minor requirements. ","credits":1},{"subject":"SOC","number":"4948","title":"Independent Study","description":"","credits":2},{"subject":"SOC","number":"4949","title":"Independent Study","description":"","credits":2},{"subject":"SOC","number":"4950","title":"Independent Study","description":"Prerequisite: Consent of instructor. Allows the student to undertake study in an area of sociology where there is no appropriate course. May be taken twice, provided that the topic is different. ","credits":3}]